In [94]:
import numpy as np 
import pandas as pd

In [95]:
data={'State':['Andhra Pradesh','Andhra Pradesh','TamilNadu','TamilNadu','Karnataka','Karnataka'],'Cities':['Hyderabad','Visakhapatnam','Chennai','Coimbator','Mysore','Banglore'],'Population':[68.1,20.4,98.8,21.3,12.8,85.0]}

In [96]:
df=pd.DataFrame(data)

In [97]:
df

            State         Cities  Population
0  Andhra Pradesh      Hyderabad        68.1
1  Andhra Pradesh  Visakhapatnam        20.4
2       TamilNadu        Chennai        98.8
3       TamilNadu      Coimbator        21.3
4       Karnataka         Mysore        12.8
5       Karnataka       Banglore        85.0

In [98]:
df['Population'].mean()

51.06666666666667

In [99]:
group=df.groupby('State')

In [100]:
group

In [101]:
group.mean()

                Population
State
Andhra Pradesh       44.25
Karnataka            48.90
TamilNadu            60.05

In [102]:
group.std()

                Population
State
Andhra Pradesh   33.728993
Karnataka        51.053110
TamilNadu        54.800776

In [103]:
group.sum()

                Population
State
Andhra Pradesh        88.5
Karnataka             97.8
TamilNadu            120.1

In [104]:
df.groupby('State').sum().loc['Andhra Pradesh']

Population    88.5
Name: Andhra Pradesh, dtype: float64